{
    "description": "Give me a Spotify playlist and I'll be your host for your song guessing competitions!\n\nOnce the song starts playing, you'll have 30 seconds to type in the song name or any artists into the chat. Each song name or artist is worth 1 point, but make sure to separate your answers into separate messages.",
    "game_commands": [
        {
            "emoji": "▶️",
            "usage": "start <round_limit> <spotify_playlist_link> [<spotify_playlist_link> ...]",
            "description": "Starts new guessing competition with `round_limit` rounds using the given playlist. The order of songs will be randomized. If multiple playlists are given, they will all be shuffled into one competition, removing any duplicate songs. The `round_limit` will default to the number of unique songs provided if the given value is larger than the number of unique songs."
        },
        {
            "emoji": "⏹️",
            "usage": "stop",
            "description": "Stops the guessing competition."
        },
        {
            "emoji": "⏭️",
            "usage": "skip",
            "description": "Skips the current round (points earned in that round are not saved)."
        },
        {
            "emoji": "📊",
            "usage": "leaderboard",
            "description": "Shows the all time leaderboard of games within the server."
        }
    ],
    "help_commands": [
        {
            "emoji": "⚙",
            "usage": "config",
            "description": "Displays the current configurations for the Guess the Music Bot."
        },
        {
            "emoji": "⚙",
            "usage": "config reset",
            "description": "Resets the bot's configurations to default."
        },
        {
            "emoji": "⚙",
            "usage": "config prefix <new_prefix>",
            "description": "Sets the bot's prefix to the new prefix. The default prefix is `$`."
        },
        {
            "emoji": "⚙",
            "usage": "config round_duration <seconds>",
            "description": "Sets the round duration limit to `seconds` seconds in a guessing competition. The round will automatically skip if all the answers are not answered within this time. The default round duration limit is `30`."
        },
        {
            "emoji": "ℹ️",
            "usage": "help",
            "description": "Shows help menu."
        }
    ]
}
